-- DDL и первичное наполнение таблицы:

-- Создание таблицы
CREATE TABLE test_data (
  id INT,
  rev INT,
  created_at DATE,
  updated_at DATE
);

-- Вставка начальных данных
INSERT INTO test_data (id, rev, created_at, updated_at) VALUES
(1, 2, '2020-01-01', '2020-01-01'),
(1, 4, '2020-01-01', '2020-01-03'),
(1, 3, '2020-01-01', '2020-01-05'),
(2, 2, '2020-01-01', '2020-01-01'),
(2, 5, '2020-01-01', '2020-01-07'),
(3, 6, '2020-01-01', '2020-01-01'),
(3, 2, '2020-01-01', '2020-01-11');